In [2]:
#1
import pandas as pd
import numpy as np

In [15]:
#2
first = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
second = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
third = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))
print(first,second,third)

0     2
1     1
2     1
3     4
4     2
     ..
95    2
96    1
97    2
98    4
99    4
Length: 100, dtype: int64 0     2
1     1
2     3
3     3
4     2
     ..
95    3
96    3
97    2
98    2
99    3
Length: 100, dtype: int64 0     11679
1     14199
2     22203
3     24255
4     14953
      ...
95    15780
96    17382
97    11070
98    18857
99    21833
Length: 100, dtype: int64

In [16]:
#3
df = pd.concat( [first, second, third] ,axis=1)
df.head()

   0  1      2
0  2  2  11679
1  1  1  14199
2  1  3  22203
3  4  3  24255
4  2  2  14953

In [20]:
#4
df.rename(columns={ 0 :'bedrs', 1 : 'bathrs', 2 : 'price_sqr_meter'}, inplace = True)

In [21]:
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            11679
1      1       1            14199
2      1       3            22203
3      4       3            24255
4      2       2            14953

In [25]:
#5
df_big = pd.DataFrame(pd.concat([first, second, third]))
df_big

        0
0       2
1       1
2       1
3       4
4       2
..    ...
95  15780
96  17382
97  11070
98  18857
99  21833

[300 rows x 1 columns]

In [26]:
#6
df_big.shape[0]

300